resources/docker/01/.emacs.d/configuration.org
#+TITLE: Emacs Configuration - Linux
#+AUTHOR: Kane Cullimore


#+LaTeX_CLASS: article
#+LaTeX_CLASS_OPTIONS: [10pt]

#+LaTeX_HEADER: \usepackage[a4paper,top=2.5cm,bottom=2cm,left=2cm,right=1.75cm]{geometry}
#+LaTeX_HEADER: \usepackage{fontspec}
#+LaTeX_HEADER: \setmainfont{Inconsolata}
#+LaTeX_HEADER: \setmonofont{Inconsolata}
#+LaTeX_HEADER: \setsansfont{Inconsolata}

#+LaTeX_HEADER: \usepackage{minted}
#+LaTeX_HEADER: \usemintedstyle{tango}

#+LaTeX_HEADER: \usepackage{fancyhdr}
#+LaTeX_HEADER: \pagestyle{fancyplain}

#+LaTeX_HEADER: \chead{Emacs Configuration - Linux}
#+LaTeX_HEADER: \lhead{\today}
#+LaTeX_HEADER: \rhead{Kane Cullimore}

#+Options: toc:nil

#+TOC: headlines 2

\pagebreak 

* Setup
** Location 
   Use one decimal place in the values of ‘calendar-latitude’ and
   ‘calendar-longitude’.
   #+BEGIN_SRC emacs-lisp
  (setq calendar-latitude -36.8)
  (setq calendar-longitude 174.8)
  (setq calendar-location-name "Auckland, NZ")
;;  (setq calendar-latitude 37.8)
;;  (setq calendar-longitude -122.4)
;;  (setq calendar-location-name "San Francisco, US")
   #+END_SRC

** Linux Items
   NOTE: Update Org Capture section folder locations
   #+BEGIN_SRC emacs-lisp
  ;;(setq ns-pop-up-frames nil)
  ;;(setq default-frame-alist '((top . 25) (left . 50) (width . 130) (height . 35)))
  (setq krc/default-font-size 12)
  (when window-system (scroll-bar-mode -1))
  (setq default-directory "/project")
   #+END_SRC

   #+BEGIN_SRC emacs-lisp
     (add-hook 'emacs-lisp-mode-hook 'turn-on-eldoc-mode)
     (add-hook 'lisp-interaction-mode-hook 'turn-on-eldoc-mode)
     (add-hook 'ielm-mode-hook 'turn-on-eldoc-mode)
   #+END_SRC
** Language Format  
   #+BEGIN_SRC emacs-lisp
     (set-language-environment 'utf-8)                                                           
     (setq locale-coding-system 'utf-8)                                                          
     ;; set the default encoding system                                                          
     (prefer-coding-system 'utf-8)                                                               
     (setq default-file-name-coding-system 'utf-8)                                               
     (set-default-coding-systems 'utf-8)                                                         
     (set-terminal-coding-system 'utf-8)                                                         
     (set-keyboard-coding-system 'utf-8)                                                             
     ;; Treat clipboard input as UTF-8 string first; compound text next, etc.                    
     (setq x-select-request-type '(UTF8_STRING COMPOUND_TEXT TEXT STRING)) 
   #+END_SRC  

* Package stuff
** Add Packages
   Add  package list and initialize 

   #+begin_src emacs-lisp
  (require 'package)
  (setq package-enable-at-startup nil)
  (defvar gnu '("gnu" . "http://elpa.gnu.org/packages/"))
  (defvar melpa '("melpa" . "http://melpa.org/packages/"))
  (defvar melpa-stable '("melpa-stable" . "http://stable.melpa.org/packages/"))
  (defvar org-elpa '("org" . "http://orgmode.org/elpa/"))

  (add-to-list 'package-archives melpa-stable t)
  (add-to-list 'package-archives gnu t)
  (add-to-list 'package-archives org-elpa t)

  (package-initialize)
   #+end_src

** Set up =use-package= 
   This is a nicer way of organizing config.

   #+begin_src emacs-lisp
  ;; Ensure use-package is installed
  (unless (package-installed-p 'use-package)
    (package-refresh-contents)
    (package-install 'use-package))

  ;; Configure and load use-package
  (setq use-package-always-ensure t)
  (require 'use-package)

  (eval-when-compile
    (defvar use-package-verbose t)
    (require 'use-package))
   #+end_src

* Appearance
** Tweak window chrome

   I don't usually use the menu or scroll bar, and they take up useful space.

   #+BEGIN_SRC emacs-lisp
  (setq inhibit-startup-message t)
  (setq initial-scratch-message nil)
  (tool-bar-mode 0)
  (menu-bar-mode 1)
  (scroll-bar-mode 0)

  (use-package ace-window
    :ensure t
    :init
    (progn
      (global-set-key [remap other-window] 'ace-window)
      (custom-set-faces 
       '(aw-leading-char-face
          ((t (:inherit ace-jump-face-foreground :height 6.0)))))))
   #+END_SRC

** Use fancy lambdas

   Why not?

   #+BEGIN_SRC emacs-lisp
  (global-prettify-symbols-mode t)
   #+END_SRC

** Custom solarized-dark theme (-not current-)

   I like the solarized-dark theme. I prefer keeping all the characters in the same
   size and font, though.


  (use-package solarized-theme
    :ensure t)
  (defun krc/apply-solarized-theme ()
    (setq solarized-use-variable-pitch nil)
    (setq solarized-height-plus-1 1.0)
    (setq solarized-height-plus-2 1.0)
    (setq solarized-height-plus-3 1.0)
    (setq solarized-height-plus-4 1.0)
    (setq solarized-high-contrast-mode-line t)
    (load-theme 'solarized-dark t))


  ;; If this code is being evaluated by =emacs --daemon=, ensure that each subsequent
  ;; frame is themed appropriately.

  (if (daemonp)
      (add-hook 'after-make-frame-functions
                (lambda (frame)
                    (krc/apply-solarized-theme)))
    (krc/apply-solarized-theme))

** Custom alect-dark-theme (current theme)

   #+BEGIN_SRC emacs-lisp
  (use-package alect-themes
    :ensure t)
  (defun krc/apply-alect-theme ()
    (setq alect-use-variable-pitch nil)
    (setq alect-height-plus-1 1.0)
    (setq alect-height-plus-2 1.0)
    (setq alect-height-plus-3 1.0)
    (setq alect-height-plus-4 1.0)
    (setq alect-high-contrast-mode-line t)
    (load-theme 'alect-dark t))


  ;; If this code is being evaluated by =emacs --daemon=, ensure that each subsequent
  ;; frame is themed appropriately.


  (if (daemonp)
      (add-hook 'after-make-frame-functions
                (lambda (frame)
                    (krc/apply-alect-theme)))
    (krc/apply-alect-theme))
   #+END_SRC


** Custom spacegray-theme (-not current-)


  (use-package spacegray-theme
    :ensure t)
  (defun krc/apply-spacegray-theme ()
    (setq spacegray-use-variable-pitch nil)
    (setq spacegray-height-plus-1 1.0)
    (setq spacegray-height-plus-2 1.0)
    (setq spacegray-height-plus-3 1.0)
    (setq spacegray-height-plus-4 1.0)
    (setq spacegray-high-contrast-mode-line t)
    (load-theme 'spacegray t))


  ;; If this code is being evaluated by =emacs --daemon=, ensure that each subsequent
  ;; frame is themed appropriately.


  (if (daemonp)
      (add-hook 'after-make-frame-functions
                (lambda (frame)
                    (krc/apply-spacegray-theme)))
    (krc/apply-spacegray-theme))


** Disable visual bell
   This disables the bell altogether.

   #+BEGIN_SRC emacs-lisp
  (setq ring-bell-function 'ignore)
   #+END_SRC

** Set default font and configure font resizing

   Depending on the font, including a Unicode character on a line sometimes makes
   that line bizarrely huge, which is super ugly. My preferred font (Inconsolata)
   doesn't seem to handle Unicode especially well.

   Luckily, the =unicode-fonts= package can totally mitigate this problem! I don't
   really know how it works, but I can't argue with the results.

   #+BEGIN_SRC emacs-lisp
 (use-package unicode-fonts
  :ensure t
  :init)
  (unicode-fonts-setup)
   #+END_SRC


   The standard =text-scale-= functions just resize the text in the current buffer;
   I'd generally like to resize the text in /every/ buffer, and I usually want to
   change the size of the modeline, too (this is especially helpful when
   presenting). These functions and bindings let me resize everything all together!


   #+BEGIN_SRC emacs-lisp
    
  (require 'unicode-fonts)
  
  (setq krc/default-font "Inconsolata")
  (setq krc/current-font-size krc/default-font-size)
  (setq krc/font-change-increment 1.1)

  (defun krc/font-code ()
    "Return a string representing the current font (like \"Inconsolata-14\")."
    (concat krc/default-font "-" (number-to-string krc/current-font-size)))

  (defun krc/set-font-size ()
    "Set the font to `krc/default-font' at `krc/current-font-size'.
  Set that for the current frame, and also make it the default for
  other, future frames."
    (let ((font-code (krc/font-code)))
      (add-to-list 'default-frame-alist (cons 'font font-code))
      (set-frame-font font-code)))

  (defun krc/reset-font-size ()
    "Change font size back to `krc/default-font-size'."
    (interactive)
    (setq krc/current-font-size krc/default-font-size)
    (krc/set-font-size))

  (defun krc/increase-font-size ()
    "Increase current font size by a factor of `krc/font-change-increment'."
    (interactive)
    (setq krc/current-font-size
          (ceiling (* krc/current-font-size krc/font-change-increment)))
    (krc/set-font-size))

  (defun krc/decrease-font-size ()
    "Decrease current font size by a factor of `krc/font-change-increment', down to a minimum size of 1."
    (interactive)
    (setq krc/current-font-size
          (max 1
               (floor (/ krc/current-font-size krc/font-change-increment))))
    (krc/set-font-size))

  (define-key global-map (kbd "C-)") 'krc/reset-font-size)
  (define-key global-map (kbd "C-+") 'krc/increase-font-size)
  (define-key global-map (kbd "C-=") 'krc/increase-font-size)
  (define-key global-map (kbd "C-_") 'krc/decrease-font-size)
  (define-key global-map (kbd "C--") 'krc/decrease-font-size)

  (krc/reset-font-size)
   #+END_SRC

** Highlight the current line

   =global-hl-line-mode= softly highlights the background color of the line
   containing point. It makes it a bit easier to find point, and it's useful when
   pairing or presenting code.

   #+BEGIN_SRC emacs-lisp
  (when window-system
    (global-hl-line-mode))
   #+END_SRC

** Highlight uncommitted changes

   Use the =diff-hl= package to highlight changed-and-uncommitted lines when
   programming.

   #+BEGIN_SRC emacs-lisp
  (use-package diff-hl
    :ensure t) 
  (add-hook 'prog-mode-hook 'turn-on-diff-hl-mode)
  (add-hook 'vc-dir-mode-hook 'turn-on-diff-hl-mode)
   #+END_SRC
   
** Highlight matching parentheses
   #+BEGIN_SRC emacs-lisp
  (use-package rainbow-delimiters
    :ensure t)
  (add-hook 'prog-mode-hook 'rainbow-delimiters-mode)

;;  (use-package paren
;;    :ensure t)
;;  (show-paren-mode 1)

(use-package smartparens
  :ensure t
  :init)
  (smartparens-global-mode 1)
  (show-smartparens-global-mode 1)

   #+END_SRC

