resources/docker/01/.emacs.d/configuration.el
(setq calendar-latitude -36.8)
  (setq calendar-longitude 174.8)
  (setq calendar-location-name "Auckland, NZ")
;;  (setq calendar-latitude 37.8)
;;  (setq calendar-longitude -122.4)
;;  (setq calendar-location-name "San Francisco, US")

;;(setq ns-pop-up-frames nil)
;;(setq default-frame-alist '((top . 25) (left . 50) (width . 130) (height . 35)))
(setq krc/default-font-size 12)
(when window-system (scroll-bar-mode -1))
(setq default-directory "/project")

(add-hook 'emacs-lisp-mode-hook 'turn-on-eldoc-mode)
(add-hook 'lisp-interaction-mode-hook 'turn-on-eldoc-mode)
(add-hook 'ielm-mode-hook 'turn-on-eldoc-mode)

(set-language-environment 'utf-8)                                                           
(setq locale-coding-system 'utf-8)                                                          
;; set the default encoding system                                                          
(prefer-coding-system 'utf-8)                                                               
(setq default-file-name-coding-system 'utf-8)                                               
(set-default-coding-systems 'utf-8)                                                         
(set-terminal-coding-system 'utf-8)                                                         
(set-keyboard-coding-system 'utf-8)                                                             
;; Treat clipboard input as UTF-8 string first; compound text next, etc.                    
(setq x-select-request-type '(UTF8_STRING COMPOUND_TEXT TEXT STRING))

(require 'package)
(setq package-enable-at-startup nil)
(defvar gnu '("gnu" . "http://elpa.gnu.org/packages/"))
(defvar melpa '("melpa" . "http://melpa.org/packages/"))
(defvar melpa-stable '("melpa-stable" . "http://stable.melpa.org/packages/"))
(defvar org-elpa '("org" . "http://orgmode.org/elpa/"))

(add-to-list 'package-archives melpa-stable t)
(add-to-list 'package-archives melpa t)
(add-to-list 'package-archives gnu t)
(add-to-list 'package-archives org-elpa t)

(package-initialize)

;; Ensure use-package is installed
(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))

;; Configure and load use-package
(setq use-package-always-ensure t)
(require 'use-package)

(eval-when-compile
  (defvar use-package-verbose t)
  (require 'use-package))

(setq inhibit-startup-message t)
(setq initial-scratch-message nil)
(tool-bar-mode 0)
(menu-bar-mode 1)
(scroll-bar-mode 0)

(use-package ace-window
  :ensure t
  :init
  (progn
    (global-set-key [remap other-window] 'ace-window)
    (custom-set-faces 
     '(aw-leading-char-face
        ((t (:inherit ace-jump-face-foreground :height 6.0)))))))

(global-prettify-symbols-mode t)

(use-package alect-themes
  :ensure t)
(defun krc/apply-alect-theme ()
  (setq alect-use-variable-pitch nil)
  (setq alect-height-plus-1 1.0)
  (setq alect-height-plus-2 1.0)
  (setq alect-height-plus-3 1.0)
  (setq alect-height-plus-4 1.0)
  (setq alect-high-contrast-mode-line t)
  (load-theme 'alect-dark t))


;; If this code is being evaluated by =emacs --daemon=, ensure that each subsequent
;; frame is themed appropriately.


(if (daemonp)
    (add-hook 'after-make-frame-functions
              (lambda (frame)
                  (krc/apply-alect-theme)))
  (krc/apply-alect-theme))

(setq ring-bell-function 'ignore)

(use-package unicode-fonts
 :ensure t
 :init)
 (unicode-fonts-setup)

(require 'unicode-fonts)

(setq krc/default-font "Inconsolata")
(setq krc/current-font-size krc/default-font-size)
(setq krc/font-change-increment 1.1)

(defun krc/font-code ()
  "Return a string representing the current font (like \"Inconsolata-14\")."
  (concat krc/default-font "-" (number-to-string krc/current-font-size)))

(defun krc/set-font-size ()
  "Set the font to `krc/default-font' at `krc/current-font-size'.
Set that for the current frame, and also make it the default for
other, future frames."
  (let ((font-code (krc/font-code)))
    (add-to-list 'default-frame-alist (cons 'font font-code))
    (set-frame-font font-code)))

(defun krc/reset-font-size ()
  "Change font size back to `krc/default-font-size'."
  (interactive)
  (setq krc/current-font-size krc/default-font-size)
  (krc/set-font-size))

(defun krc/increase-font-size ()
  "Increase current font size by a factor of `krc/font-change-increment'."
  (interactive)
  (setq krc/current-font-size
        (ceiling (* krc/current-font-size krc/font-change-increment)))
  (krc/set-font-size))

(defun krc/decrease-font-size ()
  "Decrease current font size by a factor of `krc/font-change-increment', down to a minimum size of 1."
  (interactive)
  (setq krc/current-font-size
        (max 1
             (floor (/ krc/current-font-size krc/font-change-increment))))
  (krc/set-font-size))

(define-key global-map (kbd "C-)") 'krc/reset-font-size)
(define-key global-map (kbd "C-+") 'krc/increase-font-size)
(define-key global-map (kbd "C-=") 'krc/increase-font-size)
(define-key global-map (kbd "C-_") 'krc/decrease-font-size)
(define-key global-map (kbd "C--") 'krc/decrease-font-size)

(krc/reset-font-size)

(when window-system
  (global-hl-line-mode))

(use-package diff-hl
  :ensure t) 
(add-hook 'prog-mode-hook 'turn-on-diff-hl-mode)
(add-hook 'vc-dir-mode-hook 'turn-on-diff-hl-mode)

(use-package rainbow-delimiters
    :ensure t)
  (add-hook 'prog-mode-hook 'rainbow-delimiters-mode)

;;  (use-package paren
;;    :ensure t)
;;  (show-paren-mode 1)

(use-package smartparens
  :ensure t
  :init)
  (smartparens-global-mode 1)
  (show-smartparens-global-mode 1)
