resources/docker/01/.emacs.d/configuration.org
** Hide certain modes from the modeline
   I'd rather have only a few necessary mode identifiers on my modeline. This
   either hides or "renames" a variety of major or minor modes using the =diminish=
   package.

   #+BEGIN_SRC emacs-lisp
  (use-package diminish
    :ensure t
    :init) 

  (defmacro diminish-minor-mode (filename mode &optional abbrev)
    `(eval-after-load (symbol-name ,filename)
      '(diminish ,mode ,abbrev)))
  (defmacro diminish-major-mode (mode-hook abbrev)
    `(add-hook ,mode-hook
               (lambda () (setq mode-name ,abbrev))))
  (diminish-minor-mode 'simple 'auto-fill-function)
  (diminish-minor-mode 'eldoc 'eldoc-mode)
  (diminish-minor-mode 'global-whitespace 'global-whitespace-mode)
  (diminish-minor-mode 'projectile 'projectile-mode)
  (diminish-minor-mode 'ruby-end 'ruby-end-mode)
  (diminish-minor-mode 'subword 'subword-mode)
  (diminish-minor-mode 'undo-tree 'undo-tree-mode)
  (diminish-minor-mode 'yard-mode 'yard-mode)
  (diminish-minor-mode 'yasnippet 'yas-minor-mode)
  (diminish-minor-mode 'wrap-region 'wrap-region-mode)
  (diminish-major-mode 'emacs-lisp-mode-hook "el")
  (diminish-major-mode 'haskell-mode-hook "λ=")
  (diminish-major-mode 'lisp-interaction-mode-hook "λ")
  (diminish-major-mode 'python-mode-hook "Py")
   #+END_SRC

** Include line numbers

   #+BEGIN_SRC emacs-lisp
  (global-display-line-numbers-mode)
   #+END_SRC
   (when (version<= "26.0.50" emacs-version )
   (global-display-line-numbers-mode))

* Navigation

** Scroll up/down (keybinding)

   #+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "M-p") 'scroll-down-command)
  (global-set-key (kbd "M-n") 'scroll-up-command)
   #+END_SRC

** Scroll conservatively

   When point goes outside the window, Emacs usually recenters the buffer point.
   I'm not crazy about that. This changes scrolling behavior to only scroll as far
   as point goes.

   #+BEGIN_SRC emacs-lisp
  (use-package smooth-scrolling
    :ensure t 
    :config 
    (setq smooth-scroll-margin 3
          scroll-conservatively 1
          scroll-preserve-screen-position t
          auto-window-vscroll nil
          scroll-margin 3
          smooth-scrooling-mode 1))
    ;; scroll one line at a time (less "jumpy" than defaults)
    (setq mouse-wheel-scroll-amount '(3 ((shift) . 9))) ;; one line at a time
    (setq mouse-wheel-progressive-speed nil) ;; don't accelerate scrolling
    (setq mouse-wheel-follow-mouse 't) ;; scroll window under mouse
    (setq scroll-step 3) ;; keyboard scroll 3 line at a time
   #+END_SRC

** Interactively-do
   Is a nice replacement for most internal prompts.

   #+BEGIN_SRC emacs-lisp
  (use-package ido
    :ensure t
    :init)
  (use-package ido-vertical-mode
    :ensure t
    :init)
  (use-package flx-ido
    :ensure t
    :init)
  (setq ido-enable-flex-matching t)

  (setq ido-everywhere t)
  (ido-mode 1)
  (flx-ido-mode 1) ; better/faster matching
  (setq ido-create-new-buffer 'always) ; don't confirm to create new buffers
  (ido-vertical-mode 1)
  (setq ido-vertical-define-keys 'C-n-and-C-p-only)
;;; Stops Ido searching for similar-named files if I use C-x C-s to create a new 
;;; file and buffer 
(setq ido-auto-merge-delay-time 9)
   #+END_SRC

** Use =smex= to handle =M-x= with =ido=
   #+BEGIN_SRC emacs-lisp
  (use-package smex
    :ensure t
    :init) 

  (global-set-key (kbd "M-x") 'smex)
  (global-set-key (kbd "M-X") 'smex-major-mode-commands)
   #+END_SRC
** Switch and rebalance windows when splitting

   When splitting a window, I invariably want to switch to the new window. This
   makes that automatic.

   #+BEGIN_SRC emacs-lisp
  (defun krc/split-window-below-and-switch ()
    "Split the window horizontally, then switch to the new pane."
    (interactive)
    (split-window-below)
    (balance-windows)
    (other-window 1))

  (defun krc/split-window-right-and-switch ()
    "Split the window vertically, then switch to the new pane."
    (interactive)
    (split-window-right)
    (balance-windows)
    (other-window 1))

  (global-set-key (kbd "C-x 2") 'krc/split-window-below-and-switch)
  (global-set-key (kbd "C-x 3") 'krc/split-window-right-and-switch)
   #+END_SRC

** Split horizontally for temporary buffers

   Horizonal splits are nicer for me, since I usually use a wide monitor. This is
   handy for handling temporary buffers (like compilation or test output).

   #+BEGIN_SRC emacs-lisp
  (defun krc/split-horizontally-for-temp-buffers ()
    (when (one-window-p t)
      (split-window-horizontally)))

  (add-hook 'temp-buffer-window-setup-hook
            'krc/split-horizontally-for-temp-buffers)
   #+END_SRC

** Use projectile everywhere

   #+BEGIN_SRC emacs-lisp
  (use-package projectile
    :ensure t
    :init
    (projectile-global-mode))
   #+END_SRC

** Add a bunch of engines for =engine-mode=

   Enable [[https://github.com/hrs/engine-mode][engine-mode]] and define a few useful engines.

   #+BEGIN_SRC emacs-lisp
  (use-package engine-mode
    :ensure t
    :config) 

  (defengine duckduckgo
    "https://duckduckgo.com/?q=%s"
    :keybinding "d")

  (defengine github
    "https://github.com/search?ref=simplesearch&q=%s"
    :keybinding "g")

  (defengine google
    "http://www.google.com/search?ie=utf-8&oe=utf-8&q=%s")

  (defengine rfcs
    "http://pretty-rfc.herokuapp.com/search?q=%s")

  (defengine stack-overflow
    "https://stackoverflow.com/search?q=%s"
    :keybinding "s")

  (defengine wikipedia
    "http://www.wikipedia.org/search-redirect.php?language=en&go=Go&search=%s"
    :keybinding "w")

  (defengine wiktionary
    "https://www.wikipedia.org/search-redirect.php?family=wiktionary&language=en&go=Go&search=%s")

  (defengine youtube
    "https://www.youtube.com/results?search_query=%s")

   #+END_SRC

** Quickly visit Emacs configuration

   I futz around with my dotfiles a lot. This binds =C-c e= to quickly open my
   Emacs configuration file.

   #+BEGIN_SRC emacs-lisp
  (defun krc/visit-emacs-config ()
    (interactive)
    (find-file "~/.emacs.d/configuration.org"))

  (global-set-key (kbd "C-c e") 'krc/visit-emacs-config)
   #+END_SRC

** Use treemacs
   #+BEGIN_SRC emacs-lisp
;; treemacs: a tree layout file explorer for Emacs
;; https://github.com/Alexander-Miller/treemacs
(use-package treemacs
  :bind
  ("C-c t" . treemacs)
  :config
  (progn
    (setq treemacs-collapse-dirs                 (if (executable-find "python") 3 0)
          treemacs-deferred-git-apply-delay      0.5
          treemacs-display-in-side-window        t
          treemacs-file-event-delay              5000
          treemacs-file-follow-delay             0.2
          treemacs-follow-after-init             t
          treemacs-git-command-pipe              ""
          treemacs-goto-tag-strategy             'refetch-index
          treemacs-indentation                   2
          treemacs-indentation-string            " "
          treemacs-is-never-other-window         nil
          treemacs-max-git-entries               5000
          treemacs-no-png-images                 nil
          treemacs-no-delete-other-windows       t
          treemacs-project-follow-cleanup        nil
          treemacs-persist-file                  (expand-file-name ".cache/treemacs-persist" user-emacs-directory)
          treemacs-recenter-distance             0.1
          treemacs-recenter-after-file-follow    nil
          treemacs-recenter-after-tag-follow     nil
          treemacs-recenter-after-project-jump   'always
          treemacs-recenter-after-project-expand 'on-distance
          treemacs-show-cursor                   nil
          treemacs-show-hidden-files             t
          treemacs-silent-filewatch              nil
          treemacs-silent-refresh                nil
          treemacs-sorting                       'alphabetic-desc
          treemacs-space-between-root-nodes      t
          treemacs-tag-follow-cleanup            t
          treemacs-tag-follow-delay              1.5
          treemacs-width                         40)

    ;; The default width and height of the icons is 22 pixels. If you are
    ;; using a Hi-DPI display, uncomment this to double the icon size.
    ;;(treemacs-resize-icons 44)

    (treemacs-follow-mode t)
    (treemacs-filewatch-mode t)
    (treemacs-fringe-indicator-mode t)
    (pcase (cons (not (null (executable-find "git")))
                 (not (null (executable-find "python3"))))
      (`(t . t)
       (treemacs-git-mode 'deferred))
      (`(t . _)
       (treemacs-git-mode 'simple))))
  :bind
  (:map global-map
        ("M-0"       . treemacs-select-window)
        ("C-x t 1"   . treemacs-delete-other-windows)
        ("C-x t t"   . treemacs)
        ("C-x t B"   . treemacs-bookmark)
        ("C-x t C-t" . treemacs-find-file)
        ("C-x t M-t" . treemacs-find-tag)))


(use-package treemacs-projectile
  :after treemacs projectile
  :ensure t)

(use-package treemacs-icons-dired
  :after treemacs dired
  :ensure t
  :config (treemacs-icons-dired-mode))


   #+END_SRC

