resources/docker/01/.emacs.d/configuration.el

(use-package tabbar
  :ensure t
  :bind
  ;; these don't work in osx terminal becaues iterm intercepts these
  ;; and switches tab
  ;; ("<C-S-iso-lefttab>" . tabbar-backward)
  ;; ("<C-tab>" . tabbar-forward)

  :init
  (progn
    (tabbar-mode t)

    ;; TABBAR STYLES

    (set-face-attribute
     'tabbar-default nil
     :background "gray20"
     :foreground "gray20"
     :box '(:line-width 1 :color "gray20" :style nil))

    (set-face-attribute
     'tabbar-unselected nil
     :background "gray30"
     :foreground "white"
     :underline nil
     :box '(:line-width 5 :color "gray30" :style nil))

    (set-face-attribute
     'tabbar-modified nil
     :background "gray30"
     :foreground "red"
     :underline nil
     :box '(:line-width 5 :color "gray30" :style nil))

    (set-face-attribute
     'tabbar-selected nil
     :background "white"
     :foreground "black"
     :underline nil
     :box '(:line-width 5 :color "white" :style nil))

    ;; highlight is hover behavior
    (set-face-attribute
     'tabbar-highlight nil
     :background "DarkCyan"
     :foreground "green"
     :underline nil
     :box '(:color "DarkCyan" :style nil))

    ;; defaults for button
    (set-face-attribute
     'tabbar-button nil
     :underline nil
     :box '(:line-width 1 :color "white" :style nil))
    ;; (set-face-attribute
    ;;  'tabbar-separator nil
    ;;  :background "gray20"
    ;;  :height 0.6)

    ;; example tabbar coloring code...
    ;; (set-face-attribute
    ;;  'tabbar-default nil
    ;; :background "gray24")
    (set-face-attribute
     'tabbar-unselected nil
     :background "gray34"
     :foreground "white"
     :box '(:line-width 1 :color "white" :style released-button))

    (set-face-attribute
     'tabbar-modified nil
     :background "gray34"
     :foreground "pink"
     :inherit 'tabbar-unselected
     :box '(:line-width 1 :color "white" :style released-button))

    (set-face-attribute
     'tabbar-selected nil
     :background "#bcbcbc"
     :foreground "black"
     :box nil)

    (set-face-attribute
     'tabbar-button nil
     :box '(:line-width 1 :color "gray72" :style released-button))

    (set-face-attribute
     'tabbar-separator nil
     :height 0.7)

    ;; set big fonts
    (set-face-attribute
     'tabbar-button nil
     :inherit 'tabbar-default-face
     :box '(:line-width 1 :color "gray30"))

    (set-face-attribute 'tabbar-default  nil
     ;;:family "Courier"
     :height 1.1)

    (set-face-attribute
     'tabbar-selected nil
     :inherit 'tabbar-default-face
     :foreground "blue3"
     :background "LightGoldenrod"
     :box '(:line-width 1 :color "DarkGoldenrod")
     ;;:overline "black" :underline "black"
     :weight 'bold)

    (set-face-attribute
     'tabbar-unselected nil
     :inherit 'tabbar-default-face
     :box '(:line-width 1 :color "gray70"))
    ;;end set big fonts

    ;; Change padding of the tabs
    ;; we also need to set separator to avoid overlapping tabs by highlighted tabs
    (custom-set-variables
     '(tabbar-separator (quote (0.5))))
    ;; adding spaces
    (defun tabbar-buffer-tab-label (tab)
      "Return a label for TAB.
That is, a string used to represent it on the tab bar."
      (let ((label  (if tabbar--buffer-show-groups
			(format " [%s] " (tabbar-tab-tabset tab))
		      (format " %s " (tabbar-tab-value tab)))))
	;; Unless the tab bar auto scrolls to keep the selected tab
	;; visible, shorten the tab label to keep as many tabs as possible
	;; in the visible area of the tab bar.
	(if tabbar-auto-scroll-flag
	    label
	  (tabbar-shorten
	   label (max 1 (/ (window-width)
			   (length (tabbar-view
                                    (tabbar-current-tabset)))))))))

    )
  )

(global-set-key (kbd "<C-next>")  'tabbar-forward)
(global-set-key (kbd "<C-prior>")  'tabbar-backward)

(use-package sudo-edit
  :ensure t)

(save-place-mode t)

(setq indent-tabs-mode nil)

(global-set-key (kbd "C-z") 'undo)
(global-set-key (kbd "C-S-z") 'redo)
(setq cua-rectangle-mark-key (kbd "C-^"))
(cua-mode t)

;; Make it so you only need to type 'y' or 'n' not 'yes' or 'no'
 (fset 'yes-or-no-p 'y-or-n-p)

 ;; Support the mouse and colors in the terminal
 (xterm-mouse-mode t)

 ;; "Allow 20MB of memory (instead of 0.76MB) before calling garbage collection. 
 ;; This means GC runs less often, which speeds up some operations."
 (setq gc-cons-threshold 20000000)

 ;; "When opening a file, always follow symlinks."
 (setq vc-follow-symlinks t)

  ;; "Don't assume that sentences should have two spaces after periods. This ain't a typewriter."
 (setq sentence-end-double-space nil)

 ;; "Turn on transient-mark-mode."
 (transient-mark-mode t)

 ;; "If some text is selected, and you type some text, delete the selected text and start inserting your typed text."
 (delete-selection-mode t)

 ;; "Add file sizes in human-readable units (KB, MB, etc) to dired buffers."
 ;;(setq-default dired-listing-switches "-alh")

 ;; "Turn on syntax highlighting whenever possible."
 ;;(global-font-lock-mode t)

 ;; "When something changes a file, automatically refresh the buffer containing that file so they can't get out of sync."
 ;;(global-auto-revert-mode t)

 ;; "When you double-click on a file in the Mac Finder open it as a buffer in the existing Emacs frame, rather than creating a new frame just for that file."
 ;;(setq ns-pop-up-frames nil)

 ;; "When middle-clicking the mouse to yank from the clipboard, insert the text where point is, not where the mouse cursor is."
 (setq mouse-yank-at-point t)

 ;; "Make <home> and <end> move point to the beginning and end of the line, respectively."
 (global-set-key (kbd "<home>") 'move-beginning-of-line)
 (global-set-key (kbd "<end>") 'move-end-of-line)

;; "When saving a file in a directory that doesn't exist, offer to (recursively) create the file's parent directories."
; (add-hook 'before-save-hook
;           (lambda ()
;             (when buffer-file-name
;               (let ((dir (file-name-directory buffer-file-name)))
;                 (when (and (not (file-exists-p dir))
;                            (y-or-n-p (format "Directory %s does not exist. Create it?" dir)))
;                   (make-directory dir t))))))

(use-package anzu
  :ensure t
  :config)
(global-anzu-mode +1)
(global-set-key [remap query-replace] 'anzu-query-replace)
(global-set-key [remap query-replace-regexp] 'anzu-query-replace-regexp)

(use-package iedit
  :ensure t
  :commands (iedit-mode)
  :bind* (("C-u" . iedit-mode)))

(use-package org-bullets
  :ensure t
  :init
  (add-hook 'org-mode-hook #'org-bullets-mode))

(setq org-ellipsis "⤵")

(setq org-src-fontify-natively t)

(setq org-src-window-setup 'current-window)
