resources/docker/01/.emacs.d/configuration.org
** TeX configuration

   I rarely write LaTeX directly any more, but I often export through it with
   org-mode, so I'm keeping them together.

   Automatically parse the file after loading it.

   #+BEGIN_SRC emacs-lisp
(use-package auctex
  :defer t
  :ensure t)
  (setq TeX-auto-save t)
  (setq TeX-save-query nil)
  (setq TeX-parse-self t)
  ;;(setq-default TeX-master nil)
   #+END_SRC

   Always use =xelatex= when compiling LaTeX documents. 

   #+BEGIN_SRC emacs-lisp

  (setq TeX-engine-set 'XelaTeX)
  (setq TeX-show-compilation t)

  (setq org-latex-pdf-process 
    '("xelatex -interaction nonstopmode %f"
      "xelatex -interaction nonstopmode %f")) ;; for multiple passes

   #+END_SRC

   Enable a minor mode for dealing with math (it adds a few useful keybindings),
   and always treat the current file as the "main" file. That's intentional, since
   I'm usually actually in an org document.

   #+BEGIN_SRC emacs-lisp
  (add-hook 'LaTeX-mode-hook
            (lambda ()
              (LaTeX-math-mode)
              (setq TeX-master t)))

   #+END_SRC


** DocView 
View pdf in continuous mode (mouse scroll to change page) & mute notifications of updates to pdf
#+BEGIN_SRC emacs-lisp
(setq doc-view-continuous t)
(setq revert-without-query '(".*"))
#+END_SRC


** Exporting
*** General 
    Allow export to markdown and beamer (for presentations).
    #+BEGIN_SRC emacs-lisp
  (require 'ox-md)
  (require 'ox-beamer)
    #+END_SRC

    Allow =babel= to evaluate Emacs lisp, Ruby, dot, or Gnuplot code.
    #+BEGIN_SRC emacs-lisp
  (org-babel-do-load-languages  'org-babel-load-languages
   '((emacs-lisp . t)
     (ruby . t)
     (dot . t)
     (gnuplot . t)
     (R . t)
     (org . t)
     (latex . t )
     (python . t)
     (shell . t)))
    #+END_SRC

    Don't ask before evaluating code blocks.
    #+BEGIN_SRC emacs-lisp
  (setq org-confirm-babel-evaluate nil)

    #+END_SRC

    Image management
    #+BEGIN_SRC emacs-lisp
 (setq org-image-actual-width nil)
 
 ;;(setq org-startup-with-inline-images t)
 ;;(add-hook 'org-babel-after-execute-hook 'org-display-inline-images)
 ;;(add-hook 'org-mode-hook 'org-display-inline-images)
    #+END_SRC

    Associate the "dot" language with the =graphviz-dot= major mode.
    #+BEGIN_SRC emacs-lisp

 (add-to-list 'org-src-lang-modes '("dot" . graphviz-dot))

    #+END_SRC

    Translate regular ol' straight quotes to typographically-correct curly quotes
    when exporting.
    #+BEGIN_SRC emacs-lisp

 (setq org-export-with-smart-quotes t)


    #+END_SRC


*** Exporting to HTML

    Don't include a footer with my contact and publishing information at the bottom
    of every exported HTML document.
    #+BEGIN_SRC emacs-lisp
  (setq org-html-postamble nil)

  (use-package htmlize
    :ensure t
    :init)
    #+END_SRC


*** Exporting pdf with minted & IEEE Format


    I want to produce PDFs with syntax highlighting in the code. The best way to do
    that seems to be with the =minted= package, but that package shells out to
    =pygments= to do the actual work. =pdflatex= usually disallows shell commands;
    this enables that.

    Include the =minted= package in all of my LaTeX exports.


    #+BEGIN_SRC emacs-lisp


(setq org-latex-listings 'minted)

(setq org-latex-pdf-process
      '("xelatex -shell-escape -interaction nonstopmode -output-directory %o %f"
        "xelatex -shell-escape -interaction nonstopmode -output-directory %o %f"
        "xelatex -shell-escape -interaction nonstopmode -output-directory %o %f"))

  (setq org-latex-default-packages-alist: nil)
  (setq org-latex-with-hyperref: nil)
  (setq org-latex-packages-alist: nil)

(use-package bibretrieve
  :ensure t
  :init)

(add-to-list 'org-latex-classes 
      '("IEEEtran" 
        "\\documentclass[11pt]{IEEEtran}"
        ("\\section{%s}" . "\\section*{%s}")
        ("\\subsection{%s}" . "\\subsection*{%s}")
        ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
        ("\\paragraph{%s}" . "\\paragraph*{%s}")
        ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))

    #+END_SRC

    (eval-after-load 'org
    '(add-to-list 'auto-mode-alist '("\\.pdf\\'" . fundamental-mode)))


    (eval-after-load 'org
    '(add-to-list 'org-latex-packages-alist '("" "minted")))


*** Twitter Bootstrap

    (use-package ox-twbs 
    :ensure t
    :config)

    
    
** Task and org-capture management - Not using
*** Package and Folder settings

    (use-package org-ac
    :ensure t
    :init (progn
    (require 'org-ac)
    (org-ac/config-default)
    ))


    Store my org files in =~/linBox/orgfiles=, maintain an inbox in Box, define
    the location of an index file (my main todo list), and archive finished tasks in
    =~/linBox/orgfiles/archive.org=.
    pc =>     
    (setq org-directory "~/linBox/manage/org/orgfiles")
    (setq org-inbox-file "~/linBox/manage/org/inbox.org")
    mac =>    
    (setq org-directory "~/linBox/manage/org/orgfiles")
    (setq org-inbox-file "~/linBox/manage/org/inbox.org")



    (setq org-directory "~/linBox/manage/org/orgfiles/")

    (defun org-file-path (filename)
    "Return the absolute address of an org file, given its relative name."
    (concat (file-name-as-directory org-directory) filename))

    (setq org-inbox-file "~/linBox/manage/org/inbox.org")
    (setq org-index-file (org-file-path "index.org"))
    (setq org-archive-location
    (concat (org-file-path "archive.org") "::* From %s"))



    I use [[http://agiletortoise.com/drafts/][Drafts]] to create new tasks, format them according to a template, and
    append them to an "inbox.org" file in my Dropbox. This function lets me import
    them easily from that inbox file to my index.


    (defun krc/copy-tasks-from-inbox ()
    (when (file-exists-p org-inbox-file)
    (save-excursion
    (find-file org-index-file)
    (goto-char (point-max))
    (insert-file-contents org-inbox-file)
    (delete-file org-inbox-file))))


    I store all my todos in =~/linBox/org/index.org=, so I'd like to derive my
    agenda from there.

    (setq org-agenda-files (list org-index-file))


    Hitting =C-c C-x C-s= will mark a todo as done and move it to an appropriate
    place in the archive.


    (defun krc/mark-done-and-archive ()
    "Mark the state of an org-mode item as DONE and archive it."
    (interactive)
    (org-todo 'done)
    (org-archive-subtree))

    (define-key org-mode-map (kbd "C-c C-x C-s") 'krc/mark-done-and-archive)


    Record the time that a todo was archived.


    (setq org-log-done 'time)


*** Keybindings

    Bind a few handy keys.


    (define-key global-map "\C-cl" 'org-store-link)
    (define-key global-map "\C-ca" 'org-agenda)
    (define-key global-map "\C-cc" 'org-capture)


    Hit =C-c i= to quickly open up my todo list.


    (defun krc/open-index-file ()
    "Open the master org TODO list."
    (interactive)
    (krc/copy-tasks-from-inbox)
    (find-file org-index-file)
    (end-of-buffer))

    (global-set-key (kbd "C-c i") 'krc/open-index-file)


    Hit =M-n= to quickly open up a capture template for a new todo.


    (defun org-capture-todo ()
    (interactive)
    (org-capture :keys "t"))

    (global-set-key (kbd "M-n") 'org-capture-todo)


*** Capturing tasks

    Define a few common tasks as capture templates. Specifically, I frequently:

    - Record ideas for future blog posts in =~/linBox/org/blog-ideas.org=,
    - Maintain a todo list in =~/box/org/index.org=.
    - Convert emails into todos to maintain an empty inbox.


    (setq org-capture-templates
    '(("b" "Blog idea"
    entry
    (file (org-file-path "blog-ideas.org"))
    "* %?\n")

    ("e" "Email" entry
    (file+headline org-index-file "Inbox")
    "* TODO %?\n\n%a\n\n")

    ("r" "Reading"
    checkitem
    (file (org-file-path "to-read.org"))          
    ("s" "Subscribe to an RSS feed"
    plain
    (file "~/linBox/org/rss/urls")
    "%^{Feed URL} \"~%^{Feed name}\"")

    ("t" "Todo"
    entry
    (file+headline org-index-file "Inbox")
    "* TODO %?\n"))))

* Writing prose
** Look up definitions in Webster 1913 (not used) 

   I look up definitions by hitting =C-x w=, which shells out to =sdcv=. I've
   loaded that with the (beautifully lyrical) 1913 edition of Webster's dictionary,
   so these definitions are a lot of fun.


   (defun krc/dictionary-prompt ()
   (read-string
   (format "Word (%s): " (or (krc/region-or-word) ""))
   nil
   nil
   (krc/region-or-word)))

   (defun krc/dictionary-define-word ()
   (interactive)
   (let* ((word (krc/dictionary-prompt))
   (buffer-name (concat "Definition: " word)))
   (with-output-to-temp-buffer buffer-name
   (shell-command (format "sdcv -n %s" word) buffer-name))))

   (define-key global-map (kbd "C-x w") 'krc/dictionary-define-word)

** Look up words in a thesaurus (not used)

   Synosaurus is hooked up to wordnet to provide access to a thesaurus. Hitting
   =C-c C-s l= summons it.
   => FROM HERE
   (use-package  wordnut
   :ensure t
   :init)
   (add-to-list 'load-path "/usr/local/WordNet-3.0/bin/")
   (global-set-key [f12] 'wordnut-search)
   (global-set-key [(control f12)] 'wordnut-lookup-current-word)
   => TO HERE


   > not sure if this package works well
   (use-package  synosaurus
   :ensure t
   :init)
   (setq-default synosaurus-backend 'synosaurus-backend-wordnet)
   (add-hook 'after-init-hook #'synosaurus-mode)

** Editing with Markdown - Not Used

   Because I can't always use =org=.

   - Associate =.md= files with GitHub-flavored Markdown.
   - I'd like spell-checking running when editing Markdown.
   - Use =pandoc= to render the results.
   - Leave the code block font unchanged.


   (use-package markdown-mode
   :commands gfm-mode

   :mode (("\\.md$" . gfm-mode))

   :config
   (setq markdown-command "pandoc --standalone --mathjax --from=markdown")
   ;;(add-hook 'gfm-mode-hook 'flyspell-mode)
   ;;(custom-set-faces
   ;; '(markdown-code-face ((t nil)))))

** Word-Wrap paragraphs keybindings
   #+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "M-9") 'visual-line-mode)
  (global-set-key (kbd "M-8") 'toggle-truncate-lines)
  ;;(setq-default visual-line-fringe-indicators 1)

   #+END_SRC

   (use-package  adaptive-wrap
   :ensure t
   :init)
   (setq-default adaptive-wrap-prefix-mode 1)
   (setq-default truncate-lines nil)
   (setq-default fill-column 100)

** Enable region case modification (not used)


   (put 'downcase-region 'disabled nil)
   (put 'upcase-region 'disabled nil)

* Programming

** Basics
   I like shallow indentation, but tabs are displayed as 8 characters by default.
   This reduces that. 

   #+BEGIN_SRC emacs-lisp
  (setq tab-width 2)
  (setq org-src-preserve-indentation t)
   #+END_SRC

   Treating terms in CamelCase symbols as separate words makes editing a little
   easier for me, so I like to use =subword-mode= everywhere.

   #+BEGIN_SRC emacs-lisp
  ;;(global-subword-mode 1)
   #+END_SRC

   Compilation output goes to the =*compilation*= buffer. I rarely have that window
   selected, so the compilation output disappears past the bottom of the window.
   This automatically scrolls the compilation window so I can always see the
   output.

   #+BEGIN_SRC emacs-lisp
  ;;(setq compilation-scroll-output t)
   #+END_SRC

** Exec Path from shell - Not Used


   (use-package exec-path-from-shell
   :init
   (setq exec-path-from-shell-check-startup-files nil)
   (when (memq window-system '(mac ns x))
   (exec-path-from-shell-initialize)))






   (


   )
** Flycheck 
  
   Use =flycheck= for syntax checking:
   #+BEGIN_SRC emacs-lisp
(use-package flycheck
  :ensure t
  :config
  (progn
    (add-hook 'after-init-hook 'global-flycheck-mode)
    (add-hook 'prog-mode-hook 'flycheck-mode)
    (add-hook 'text-mode-hook 'flycheck-mode)
    (add-hook 'org-mode-hook 'flycheck-mode)
    ;;(add-hook 'python-mode-hook 'flycheck-mode)
    (add-hook 'elpy-mode-hook 'flycheck-mode)
    (add-hook 'ess-mode-hook (lambda () (flycheck-mode t)))
  )
  :custom
  (flycheck-display-errors-delay .3))


   #+END_SRC

  :config
  (progn
    (add-hook 'after-init-hook 'global-flycheck-mode)
    (add-hook 'prog-mode-hook 'flycheck-mode)
    (add-hook 'text-mode-hook 'flycheck-mode)
    (add-hook 'org-mode-hook 'flycheck-mode)
    ;;(add-hook 'python-mode-hook 'flycheck-mode)
    (add-hook 'elpy-mode-hook 'flycheck-mode)
    (add-hook 'ess-mode-hook (lambda () (flycheck-mode t)))
  )
)

(use-package flycheck
  :ensure t
  :init (global-flycheck-mode)
  :custom
  (flycheck-display-errors-delay .3))



   (use-package flycheck
   :ensure t
   :config
   (progn
   (add-hook 'after-init-hook #'global-flycheck-mode)
   (add-hook 'prog-mode-hook 'flycheck-mode)
   (add-hook 'text-mode-hook 'flycheck-mode)
   (add-hook 'org-mode-hook 'flycheck-mode)
   ;;(add-hook 'python-mode-hook 'flycheck-mode)
   (add-hook 'elpy-mode-hook 'flycheck-mode)
   (add-hook 'ess-mode-hook (lambda () (flycheck-mode t)))
   ))

** company-mode 
   #+BEGIN_SRC emacs-lisp
(use-package company
  :ensure t
  :init
  (setq company-tooltip-align-annotations t
        company-tooltip-minimum-width 30)
  :config (global-company-mode))

   #+END_SRC

