resources/docker/01/.emacs.d/configuration.el

(use-package auctex
  :defer t
  :ensure t)
  (setq TeX-auto-save t)
  (setq TeX-save-query nil)
  (setq TeX-parse-self t)
  ;;(setq-default TeX-master nil)

(setq TeX-engine-set 'XelaTeX)
(setq TeX-show-compilation t)

(setq org-latex-pdf-process 
  '("xelatex -interaction nonstopmode %f"
    "xelatex -interaction nonstopmode %f")) ;; for multiple passes

(add-hook 'LaTeX-mode-hook
          (lambda ()
            (LaTeX-math-mode)
            (setq TeX-master t)))

(setq doc-view-continuous t)
(setq revert-without-query '(".*"))

(require 'ox-md)
(require 'ox-beamer)

(org-babel-do-load-languages  'org-babel-load-languages
 '((emacs-lisp . t)
   (ruby . t)
   (dot . t)
   (gnuplot . t)
   (R . t)
   (org . t)
   (latex . t )
   (python . t)
   (shell . t)))

(setq org-confirm-babel-evaluate nil)

(setq org-image-actual-width nil)

;;(setq org-startup-with-inline-images t)
;;(add-hook 'org-babel-after-execute-hook 'org-display-inline-images)
;;(add-hook 'org-mode-hook 'org-display-inline-images)

(add-to-list 'org-src-lang-modes '("dot" . graphviz-dot))

(setq org-export-with-smart-quotes t)

(setq org-html-postamble nil)

(use-package htmlize
  :ensure t
  :init)

(setq org-latex-listings 'minted)

(setq org-latex-pdf-process
      '("xelatex -shell-escape -interaction nonstopmode -output-directory %o %f"
        "xelatex -shell-escape -interaction nonstopmode -output-directory %o %f"
        "xelatex -shell-escape -interaction nonstopmode -output-directory %o %f"))

  (setq org-latex-default-packages-alist: nil)
  (setq org-latex-with-hyperref: nil)
  (setq org-latex-packages-alist: nil)

(use-package bibretrieve
  :ensure t
  :init)

(add-to-list 'org-latex-classes 
      '("IEEEtran" 
        "\\documentclass[11pt]{IEEEtran}"
        ("\\section{%s}" . "\\section*{%s}")
        ("\\subsection{%s}" . "\\subsection*{%s}")
        ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
        ("\\paragraph{%s}" . "\\paragraph*{%s}")
        ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))

(global-set-key (kbd "M-9") 'visual-line-mode)
(global-set-key (kbd "M-8") 'toggle-truncate-lines)
;;(setq-default visual-line-fringe-indicators 1)

(setq tab-width 2)

;;(global-subword-mode 1)

;;(setq compilation-scroll-output t)

(use-package flycheck
  :ensure t
  :config
  (progn
    (add-hook 'after-init-hook 'global-flycheck-mode)
    (add-hook 'prog-mode-hook 'flycheck-mode)
    (add-hook 'text-mode-hook 'flycheck-mode)
    (add-hook 'org-mode-hook 'flycheck-mode)
    ;;(add-hook 'python-mode-hook 'flycheck-mode)
    (add-hook 'elpy-mode-hook 'flycheck-mode)
    (add-hook 'ess-mode-hook (lambda () (flycheck-mode t)))
  )
  :custom
  (flycheck-display-errors-delay .3))

(use-package company
  :ensure t
  :init
  (setq company-tooltip-align-annotations t
        company-tooltip-minimum-width 30)
  :config (global-company-mode))
