resources/docker/01/.emacs.d/configuration.org
** web-mode  
  
   #+BEGIN_SRC emacs-lisp
(use-package web-mode 
	:ensure t
	:mode 
	(("\\.phtml\\'" . web-mode)
	("\\.css\\'" . web-mode)	  
	("\\.php\\'" . web-mode)
	("\\.js\\'" . web-mode)
	("\\.jsx\\'" . web-mode)	  
	("\\.jsp\\'" . web-mode)		
	("\\.as[cp]x\\'" . web-mode)	
	("\\.erb\\'" . web-mode)		
	("\\.mustache\\'" . web-mode)	
	("\\.djhtml\\'" . web-mode)		
	("\\.jst.ejs\\'" . web-mode)	
	("\\.html?\\'" . web-mode))
      :init
	(setq web-mode-enable-block-face t)
	(setq web-mode-enable-comment-keywords t)
	(setq web-mode-enable-current-element-highlight t)
	(setq web-mode-enable-current-column-highlight t)	
	(setq web-mode-script-padding 2)
	(setq web-mode-style-padding 2)
	(setq web-mode-comment-style 2)
	(setq web-mode-code-indent-offset 2)
	(setq web-mode-markup-indent-offset 2)
	(setq web-mode-css-indent-offset 2)
	(setq web-mode-css-indent-level 2)
        (setq web-mode-auto-close-style 2)
        ;; let smartparens handle these
        (setq web-mode-enable-auto-quoting nil)
        (setq web-mode-enable-auto-pairing nil))


;; use eslint with web-mode for jsx files
(flycheck-add-mode 'javascript-eslint 'web-mode)

;; disable jshint since we prefer eslint checking
(setq-default flycheck-disabled-checkers
  (append flycheck-disabled-checkers
    '(javascript-jshint)))


;; disable json-jsonlist checking for json files
(setq-default flycheck-disabled-checkers
  (append flycheck-disabled-checkers
    '(json-jsonlist)))

(defun pk-web-mode-hook ()
  "Hooks for Web mode."
  (set-face-attribute 'web-mode-html-tag-bracket-face nil :foreground "#e8e815")
  (set-face-attribute 'web-mode-html-tag-face nil :foreground "#e5c900")
  (set-face-attribute 'web-mode-html-attr-name-face nil :foreground "#ebabde")
  (set-face-attribute 'web-mode-html-attr-value-face nil :foreground "#8cf1f1")
  ;;(set-face-attribute 'web-mode-html-attr-value-face nil :foreground "#42f2ff")
  )
(add-hook 'web-mode-hook  'pk-web-mode-hook)

   #+END_SRC

   ;; use local eslint from node_modules before global
   ;; http://emacs.stackexchange.com/questions/21205/flycheck-with-file-relative-eslint-executable
   (defun my/use-eslint-from-node-modules ()
   (let* ((root (locate-dominating-file
   (or (buffer-file-name) default-directory)
   "node_modules"))
   (eslint (and root
   (expand-file-name "node_modules/eslint/bin/eslint.js"
   root))))
   (when (and eslint (file-executable-p eslint))
   (setq-local flycheck-javascript-eslint-executable eslint))))
   (add-hook 'flycheck-mode-hook #'my/use-eslint-from-node-modules)

** prettier.js

   #+BEGIN_SRC emacs-lisp
(use-package prettier-js
    :ensure t
    :config)

(add-hook 'web-mode-hook 'prettier-js-mode)

   #+END_SRC

** typescript via tide  


   https://github.com/ananthakumaran/tide

   #+BEGIN_SRC emacs-lisp

     (use-package js2-mode
     :ensure t
     :init)

     (use-package json-mode
     :ensure t
     :mode "\\.json\\'"
     :init)

     ;; TypeScript
     (use-package typescript-mode
     :ensure t
     :mode "\\.ts\\'"
     :init)

     ;; (use-package rjsx-mode 
     ;; :ensure t
     ;; :mode (("\\.jsx\\'" . rjsx-mode)
     ;;        ("\\.js\\'" . rjsx-mode))
     ;; :init)


     (defun setup-tide-mode ()
       (interactive)
       (tide-setup)
       (flycheck-mode +1)
       (setq flycheck-check-syntax-automatically '(save mode-enabled))
       (eldoc-mode +1)
       (tide-hl-identifier-mode +1)
       (company-mode +1))

     (use-package tide
       :ensure t
       :config
       (progn
	 (add-hook 'typescript-mode-hook #'setup-tide-mode)
	 (add-hook 'rjsx-mode-hook #'setup-tide-mode)
	 (add-hook 'before-save-hook 'tide-format-before-save)))


	  ;; this magic incantation fixes highlighting of jsx syntax in .js files
	      (setq web-mode-content-types-alist
		    '(("jsx" . "\\.js[x]?\\'")))
	      (add-hook 'web-mode-hook
		    (lambda ()
		      (setq web-mode-code-indent-offset 2)
		      (when (string-equal "tsx" (file-name-extension buffer-file-name))
			(setup-tide-mode))
		      (when (string-equal "jsx" (file-name-extension buffer-file-name))
			(setup-tide-mode))
		      (when (string-equal "js" (file-name-extension buffer-file-name))
			(progn
			  (setup-tide-mode)
			  (with-eval-after-load 'flycheck
			    (flycheck-add-mode 'typescript-tslint 'web-mode)
			    (flycheck-add-mode 'javascript-tide 'web-mode))))))


   #+END_SRC

** Apache Mode
   #+BEGIN_SRC emacs-lisp
(use-package apache-mode     
  :ensure t
  :init)

   #+END_SRC

** Flyspell

   #+BEGIN_SRC emacs-lisp


(use-package flyspell
  :ensure t
  :defer t
  :init
  (progn
    (add-hook 'prog-mode-hook 'flyspell-prog-mode)
    (add-hook 'text-mode-hook 'flyspell-mode)
    (add-hook 'org-mode-hook 'flyspell-mode)
    )
  :config
  ;; Sets flyspell correction to use two-finger mouse click
  (define-key flyspell-mouse-map [down-mouse-3] #'flyspell-correct-word)
)

   #+END_SRC

** Python
   NOTE: review flycheck details for support

   Enable =elpy=. This provides automatic indentation, auto-completion, syntax
   checking, etc.


   #+BEGIN_SRC emacs-lisp
  (use-package find-file-in-project
    :ensure t
    :config)

  (use-package highlight-indentation
  :ensure t
    :config)

  (use-package elpy
    :ensure t
    :config
    (elpy-enable))

  (setq elpy-rpc-backend "jedi")                    

  (setq elpy-modules '(elpy-module-company
                       elpy-module-eldoc
                       elpy-module-pyvenv
                       elpy-module-yasnippet
                       elpy-module-sane-defaults
                       ;;elpy-module-rope
                       ;;elpy-module-autopep8
                       ;;elpy-module-yapf
                       ;;elpy-module-jedi
)
)

    
  (use-package pyvenv
    :ensure t
    :config)

  (pyvenv-activate "~/Environments/project_01/myenv")
  
  (setq python-shell-completion-native-disabled-interpreters '("python"))                                                                                                                                                       
                                                                                                                                               
  (setq python-indent-guess-indent-offset t)  
  (setq python-indent-guess-indent-offset-verbose nil)

  ;;(setq python-use-auto-complete t)
  ;;(setq python-shell-interpreter "python3")

 

   #+END_SRC

** ESS-R
   NOTE: review flycheck details for support

   R Modes
   #+BEGIN_SRC emacs-lisp

   (use-package ess
    :ensure t
    :init (require 'ess-site))
  
  ;; Supposedly AC and ESS have default use to TRUE
  ;; (setq ess-use-auto-complete t) 

  ;; R process opens in own frame - if wanted
  ;;(setq inferior-ess-own-frame t)
  

  (add-hook 'ess-R-post-run-hook 'ess-execute-screen-options) 
  (ess-toggle-underscore nil) 
  


  ;;(setq ess-fancy-comments nil)
  ;;(setq ess-indent-with-fancy-comments nil)

  (setq ess-eval-visibly-p nil)
  (setq ess-ask-for-ess-directory nil)


  (define-key ess-mode-map [(control return)] nil)
  (define-key ess-mode-map [(shift return)] 'ess-eval-region-or-line-and-step)

  ;; To control the indentation level remove default settings
  ;; OR select C-c C-e C-s
  (setq ess-set-style 'RStudio)
  (defun r-custom ()
    (setq ess-default-style 'OWN)
    (setq ess-indent-level 2))
  ;; To auto-indent the whole buffer: mark the whole buffer C-x h and then indent the region with C-M-\

  (add-hook 'ess-mode-hook 'r-custom)
  ;; (setq ess-indent-level 2)
  ;;(setq ess-default-style 'DEFAULT)

  ;; (autoload 'r-mode "ess-site" "(Autoload)" t)

   #+END_SRC


   (add-hook 'inferior-ess-mode-hook '(lambda nil
   (define-key inferior-ess-mode-map [\C-up]
   'comint-previous-matching-input-from-input)
   (define-key inferior-ess-mode-map [\C-down]
   'comint-next-matching-input-from-input)
   (define-key inferior-ess-mode-map [\C-x \t]
   'comint-dynamic-complete-filename)))

** Poly-mode
   #+BEGIN_SRC emacs-lisp
(use-package poly-markdown
  :ensure t)
(use-package poly-R
  :ensure t)

(add-to-list 'auto-mode-alist '("\\.Rmd" . poly-markdown-mode))  



   #+END_SRC

** emacs-lisp indents

   Indent with 2 spaces.

   #+BEGIN_SRC emacs-lisp
  (add-hook 'sh-mode-hook
            (lambda ()
              (setq sh-basic-offset 2
                    sh-indentation 2)))
   #+END_SRC
** SQL

(use-package sqlint   
  :ensure t
  :init)


